In [1]:
import numpy as np
import pandas as pd
'''
数据截取: take, loc, iloc, head, tail
'''

'''
take:  
sampler= array([3, 1, 4, 2, 0])

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

**************df.take(sampler)后**************   是对索引进行操作的好东西  局限于numpy中
 
    0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3
'''
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([3, 2, 0, 1, 4])

In [2]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [3]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19

In [5]:
df.sample(n=3)  #随机选取子集

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
0   0   1   2   3

In [6]:
'''
loc, iloc   
loc  应该是针对行的   而iloc是针对矩阵的
df.iloc[2:4, 0:3] = np.nan   # 针对值 来操作   俩个区间  可以相互切   第一个是行区间   第二个是列区间
'''
data = pd.Series(np.random.randn(9), index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.757143
   2    0.320327
   3    0.539947
b  1   -0.909148
   3   -0.964177
c  1    2.033242
   2   -1.552063
d  2    0.914029
   3    0.893881
dtype: float64

In [7]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [8]:
data['b']

1   -0.909148
3   -0.964177
dtype: float64

In [9]:
data['b':'c']

b  1   -0.909148
   3   -0.964177
c  1    2.033242
   2   -1.552063
dtype: float64

In [10]:
data.loc[['b', 'd']]

b  1   -0.909148
   3   -0.964177
d  2    0.914029
   3    0.893881
dtype: float64

In [11]:
data.loc[:, 2]  # 第一层全部取  第二层只取值为2的

a    0.320327
c   -1.552063
d    0.914029
dtype: float64

In [12]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.482432 -0.047920  0.197395
1 -0.130973 -0.739319  0.972630
2 -0.705941 -0.493431  0.572658
3  0.303033  1.937218 -0.703561
4  1.148756  0.598905 -0.419128
5  0.397786 -0.808830 -0.488691
6  1.680690  0.521052 -0.290573

In [14]:
df.iloc[:4, 1] = np.nan    # 第一个是行区间  表示从0到3  第二个是列区间  表示第1列  
df

          0         1         2
0  0.482432       NaN  0.197395
1 -0.130973       NaN  0.972630
2 -0.705941       NaN  0.572658
3  0.303033       NaN -0.703561
4  1.148756  0.598905 -0.419128
5  0.397786 -0.808830 -0.488691
6  1.680690  0.521052 -0.290573

In [16]:
'''
loc是针对索引的  
而iloc是针对值的   
'''

RangeIndex(start=0, stop=7, step=1)

In [17]:
'''
head, tail  前5个和后5个  
'''
df.head()

          0         1         2
0  0.482432       NaN  0.197395
1 -0.130973       NaN  0.972630
2 -0.705941       NaN  0.572658
3  0.303033       NaN -0.703561
4  1.148756  0.598905 -0.419128

In [18]:
df.tail()

          0         1         2
2 -0.705941       NaN  0.572658
3  0.303033       NaN -0.703561
4  1.148756  0.598905 -0.419128
5  0.397786 -0.808830 -0.488691
6  1.680690  0.521052 -0.290573